Revit 2024 API
ParameterTypeId.ColumnBaseAttachmentOffsetParam Property
 "Offset From Attachment At Base"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ColumnBaseAttachmentOffsetParam { get; }
Visual Basic
Public Shared ReadOnly Property ColumnBaseAttachmentOffsetParam As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ColumnBaseAttachmentOffsetParam {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace